Repository: LBBO/decimal-time
Catalog: src/locale/messages.*.xlf
Languages: de_de

# disclaimer-1
source: Please don't take this page too seriously. One day, a friend and I wanted to figure out what would happen if time were based on multiples of 10 and after doing some math, we found out that this concept already existed and has been implemented in multiple countries and cultures.
de_de: Bitte nehmen Sie diese Seite nicht zu ernst. Irgendwann wollten ein Freund und ich mal überlegen, was passieren würde, wenn die Zeit auf Vielfachen von 10 basieren würde, und nachdem wir ein wenig rumgerechnet haben, haben wir rausgefunden, dass das Konzept bereits in mehreren Ländern und Kulturen existiert hat.

# disclaimer-2
source: Also, this was mainly a learning project, so please excuse potential bad design / UX choices and poor code quality. The code is meant to never be touched again.
de_de: Außerdem war das hier hauptsächlich ein Lernprojekt, als entschuldigen Sie eventuelles schlechte Design- / UX-Entscheidungen und geringe Code-Qualität. Der Code ist nicht dazu gedacht, jemals wieder angerührt zu werden.

# clock-credit
source: The awesome CSS clock was originally created by Mattia Astorino and can be found <a target="_blank" href="https://codepen.io/equinusocio/pen/PoNYGGX"> here on CodeSandbox </a >.
de_de: Die hervorragende CSS Uhr wurde ursprünglich von Mattia Astorino erstellt und kann <a target="_blank" href="https://codepen .io/equinusocio/pen/PoNYGGX"> hier auf CodeSandbox </a > gefunden werden.

# history-france-title
source: France
de_de: Frankreich

# history-france-subtitle
source: 1794 - During the French Revolution
de_de: 1794 - Während der Französischen Revolution

# history-france-image-alt
source: Photo of a decimal clock from the french revolution
de_de: Foto einer Dezimaluhr aus der Französischen Revolution

# history-france-image-caption
source: The face of a decimal clock in neo-classical style. <a href="https://en.wikipedia.org/wiki/File:Decimal_Clock_face_by_Pierre_Daniel_Destigny_1798-1805.jpg" target="_blank" > Photo by DeFacto </a>
de_de: Das Uhrenblatt einer Dezimaluhr im neoklassischen Stil. <a href="https://en.wikipedia.org/wiki/File:Decimal_Clock_face_by_Pierre_Daniel_Destigny_1798-1805.jpg" target="_blank" > Foto von DeFacto </a>

# history-france-description
source: <p> Several different efforts to switch to decimal time were made in France throughout history. The most notable of which, however, was during the French Revolution. As part of a larger attempt at decimalisation (including switching to the metric system), France adopted decimal time on 22 September 1794. Its use was mandatory until 7 April 1795. </p><p> During that time, clocks were produced with both decimal and standard time, allowing for an easier conversion period. However, decimal time never caught on. In addition to decimalizing time, France also started dividing months into three <em>décades </em> of 10 days each. This change, however wasn't abolished until 1805. </p>
de_de: <p> In Frankreich gab es im Laufe der Zeit mehrere verschiedene Bemühungen, zur Dezimalzeit zu wechseln. Die bemerkenswerteste darunter war während der Französischen Revolution. Im Rahmen einer umfassenderen Bewegung der Dezimalisierung (dabei wurde u.a. zu metrischen Einheiten gewechselt) hat Frankreich am 22. September 1794 die Dezimalzeit eingeführt. Ihre Verwendung war bis zum 7. April 1795 verpflichtend. </p><p> Während dieser Zeit wurden Uhren mit sowohl normaler als auch dezimaler Zeitanzeige hergestellt, um die Übergangsphase zu erleichtern. Allerdings hat sich die Dezimalzeit nicht halten können. Zusätzlich zur Dezimalisierung der Zeit hat Frankreich auch angefangen, Monate in je drei <em>décades </em> von je 10 Tagen zu unterteilen. Diese Änderung konnte sich sogar bis 1805 halten. </p>

source: Read more
de_de: Mehr lesen

# history-china-subtitle
source: 1st millennium BC
de_de: 1. Millennium v.C.

# history-china-description
source: <p> Chinese use of decimal time started by the 1st millennium BC. It was used alongside the standard time system and slightly differed from the system that was later adopted in France and that is explained on this site. Instead of dividing the day into 10 units of time, the Chinese divided it into 100 units called <em>ke</em>. However, this was changed from time to time. For example, from 5 to 3 BC, days were divided into 120 <em>ke</em>. </p>
de_de: <p> Der chinesische Einsatz der Dezimalzeit begann bereits im 1. Millennium v.C. Sie wurde zusätzlich zur Standardzeit genutzt und wich etwas von dem in Frankreich umgesetzten System ab (s.o.). Statt den Tag in 10 Einheiten zu unterteilen, wurde er in China in 100 sog. <em>ke</em> eingeteilt. Dies hat sich von Zeit zu Zeit aber verändert. Beispielsweise wurden zwischen 5 und 3 v.C. die Tage in 120 <em>ke</em> unterteilt. </p>

# comparison-title
source: Comparison
de_de: Vergleich

# comparison-standard-title
source: Standard time
de_de: Standardzeit

# comparison-standard-description
source: <app-clock [timeService]=" normalTimeClockService"></app-clock><p> This is how you are used to measuring time. There are 24 hours in a day, 60 minutes in an hour, and 60 seconds in a minute. You probably learned this in pre-school. </p><p> These weird numbers make no real sense and are a frequent nuisance. For example, try figuring out how many seconds are in three and a half hours. Or try converting 72 km/h to m/s. Or figure out at what time 20% of the day have passed. These calculations are unnecessarily confusing, aren't they? </p>
de_de: <app-clock [timeService]=" normalTimeClockService"></app-clock> <p> So sind Sie es gewohnt, Zeit auszudrücken. Ein Tag hat 24 Stunden, eine Stunde besteht aus 60 Minuten und eine Minute enthält 60 Sekunden. Vermutlich haben Sie das bereits im Kindergarten gelernt. </p><p> Diese eigenartigen Zahlen ergeben keinen wirklichen Sinn und sorgen häufig für nervige Rechenprobleme. Versuchen Sie doch mal beispielsweise herauszufinden, aus wie vielen Sekunden dreieinhalb Stunden bestehen. Oder konvertieren Sie mal 72 km/h zu m/s. Oder berechnen Sie, um wie viel Uhr exakt 20% eines Tages vorbei sind. Diese Berechnungen sind unnötig kompliziert, oder? </p>

# comparison-decimal-title
source: Decimal time <mat-icon i18n-matTooltip=" unit notation hint|Advise users that decimal units are empfasized (i.e. italic) while standard units are not@@comparison-decimal-unit-hint " matTooltip="Decimal time units are emphasized; normal time units are not." > info_outlined </mat-icon>
de_de: Dezimalzeit <mat-icon i18n-matTooltip=" unit notation hint|Advise users that decimal units are empfasized (i.e. italic) while standard units are not " matTooltip="Decimal time units are emphasized; normal time units are not." > info_outlined </mat-icon>

# comparison-decimal-unit-hint
source: Decimal time units are emphasized; normal time units are not.
de_de: Dezimaleinheiten sind hervorgehoben; normale Einheiten nicht.

# comparison-decimal-description
source: <app-clock [timeService]=" vTimeClockService"></app-clock><p> As opposed to the standard time measuring system, this system divides units into multiples of 10. The day is divided into 10 <em>hours</em>, one <em>hour</em> is divided into 100 <em>minutes</em> and one <em>minute</em> is divided into 100 <em>seconds</em>. </p><p> Since we represent numbers in the decimal system, decimal time allows us to convert between units by simply moving the decimal point: </p><ul><li> 3.5 <em>hours</em> to <em>seconds</em>? Multiply by 100*100 (or move the decimal point four digits to the right): 3500 <em>seconds</em>. </li><li> 72 kp<em>h</em> to m/<em>s</em>? 1000 meters in a kilometer, 100 <em>seconds</em> in an <em>hour</em>, so we multiply by 1000/100=10 (or move the decimal point 3-2=1 digit to the right): 720 m/<em>s</em>. </li><li> 20% of the day? There are 10 <em>hours</em> in a day, so that would be exactly 2:00 o'clock. This also means an added bonus of easily converting something like 0.1415 days into <em>hours</em>: you just have to add the correct colons after one, three, and five digits (and add zeroes, if necessary)! So, 0.1415 days would be 1 <em>hour</em>, 41 <em>minutes</em> and 50 <em>seconds</em></li></ul>
de_de: <app-clock [timeService]=" vTimeClockService"></app-clock><p> Im Gegensatz zur Standardzeit, unterteilt diese Zeitrechnung den Tag in Vielfache von 10. Ein Tag besteht aus 10 <em>Stunden</em> , eine <em>Stunde</em> besteht aus 100 <em>Minuten</em> und eine < em>Minute</em> besteht aus 100 <em>Sekunden</em>. </p><p> Da wir Zahlen dezimal ausdrücken, erlaubt uns die Dezimalzeit eine Umrechnung schlicht durch Verschiebung des Kommas: </p><ul><li> 3.5 <em>Stunden</em> in <em>Sekunden</em>? Einfach mit 100 * 100 multiplizieren (oder das Komma um 4 Stellen nach rechts verschieben): 3500 <em>Sekunden</em>. </li><li> 72 km/<em>h</em> in m/<em>s</em>? 1000 Meter in einem Kilometer, 100 <em>Sekunden</em> in einer < em>Stunde</em>, also multiplizieren wir mit 1000/100 = 10 (oder wir verschieben das Komma um 3 - 2 = 1 Stellen nach rechts): 720 m/<em>s</em>. </li><li> 20% eines Tages? Es gibt 10 <em>Stunden</em> pro Tag, also wäre das genau um 2 Uhr. Dadurch zeigt sich auch ein zusätzlicher Bonus, der es uns erlaubt, mit Leichtigkeit aus Angaben wie 0,1415 Tagen die <em>Stunden</em> zu bestimmen: man muss einfach nur nach der ersten, der dritten und der fünften Stelle Doppelpunkte einfügen (und ggf. Nullen auffüllen)! Damit wären 0,1415 Tage genau 1 <em>Stunde</em>, 41 < em>Minuten</em> und 50 <em>Sekunden</em></li></ul>

# splashscreen-slogan
source: It's time to fix time!
de_de: Es ist an der Zeit, die Zeit zu reparieren!

# splashscreen-subtitle
source: Why are all units based on multiples of ten <em>except time</em>? <br /> Let's change that.
de_de: Wieso basieren alle Einheiten auf Vielfachen von 10, < em>außer der Zeit</em>? <br /> Ändern wir das!

# nav-home
source: Home
de_de: Start

# nav-history
source: History
de_de: Vergangenheit

# nav-about
source: About
de_de: Über

# nav-github
source: Visit on GitHub
de_de: Auf GitHub besuchen

# nav-open-popup
source: Open Navigation
de_de: Navigation öffnen

# nav-title
source: Decimal time
de_de: Dezimalzeit
